clear all% Очистка памяти
clc
h = 0.003;
p0 = 7800;
E = 200*10^9;
d = 0.15;
J = 3.14*d^3*h/8;
L = 7; % длина трубопровода
A1 = 10;
A2 = 12;
A3 = 1500000.*2.6;
A = 0.3; % сечение трубопровода
%a4 = E.*J./p0./A;
%M = pi*(d/2-h).^2*p0;
M = p0 * pi * d * h; % масса трубопровода
a4 = E.*J./M;
ZZ = 0;
N = 1; % число импульсов
x1 = L/2;
x2 = L/1;

for I = 1:N
    VV = 1; % скорость удара
    Y = 0; % функция суммы произведения
    YY = 0;
    t = 0; % дискретизированные отсчеты времени
    i = 1:2:100; % номер моды
    nnnn = 1:2:100; % число мод
    Cn = pi/2 * (2 * nnnn+1); 
    %W = E.*J/M/L.^4.*Cn.^4; % резонансные частоты
    Fd = 44100   ; % частота дискретизации, Гц
    Time = 1; % длительность сигнала, с
    Tb = 0.00004;
    t = 0.00004;

    delta = (1./2.*(A1.*i.^1.*pi.^4./(L.^4)+A2));

    W =  sqrt(A3+a4.*i.^4.*pi.^4./(L.^4)); % 

    W_MAX = max(W);

    Oi = sqrt(W.^2 - delta.^2);

    % цикл построения сигнала-------------------------------------------------------------------------
    for HHH = 1:1:(Time*Fd-1) 
        Y = pi./(M.*L.*Tb).*sum( (-1).^((i-1)./2).*exp(-delta.*t).*sin(i.*pi.*x1./L)./ ...
        ( (W.^2-pi.^2./(Tb.^2)).^2 + 4.*pi.^2.*delta.^2./(Tb.^2))...
        .*((2.*exp(delta.*Tb).*delta.*pi./Tb.*cos(Oi.*Tb) - pi.*exp(delta.*Tb)./Tb./Oi.*...
        (2.*delta.^2-W.^2+pi.^2./Tb./Tb).*sin(Oi.*Tb)+2.*pi.*delta./Tb).*cos(Oi.*t) + ...
        (pi.*exp(delta.*Tb)./Tb./Oi.*(2.*delta.^2-W.^2+pi.^2./Tb./Tb).*cos(Oi.*Tb) + ...
        2.*exp(delta.*Tb).*delta.*pi./Tb.*sin(Oi.*Tb)+pi./Tb./Oi.*(2.*delta.^2-W.^2+pi.^2./Tb./Tb)).* ...
        sin(Oi.*t)));
        t = t + 1/Fd; % отсчеты времени
        YY = [YY Y]; % конкатенация
    end
    % ------------------------------------------------------------------------------------------------

    length_YY = length(YY);
    t = 0:1/Fd:Time-1/Fd; % отсчеты времени для построения графика
    length_t = length(t);
    YYYY = YY./max(YY).* 0.7; % нормализация амплитуды
    ZZ = [ZZ YYYY];
    plot (t,YY); % сигнал от времени
    GGG = 0:1/Fd:Time - 1/Fd;
end

t = 0:1/Fd:Time.*N-1/Fd;; % отсчеты времени для построения графика
plot (t,YY); % сигнал от времени
audiowrite('ModelOfDefect_5.wav',ZZ,Fd);
% ------------------------------------------------------------------------------------------------

FFTSize = length(YY); %length(YY); - размер окна БПФ
F=0:Fd/FFTSize:Fd/2-1/FFTSize; % Массив частот вычисляемого спектра Фурье
FftS = fft((ZZ),FFTSize); % Амплитуды преобразования Фурье сигнала

figure
plot(F, 10*log(abs(FftS(1:length(F / 2)))));

figure
plot(t,ifft(FftS,length(t)));% ОБПФ

